<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 文件名
    |--------------------------------------------------------------------------
    |
    | 默认的文件名。
    |
    */

    'filename' => '_ide_helper.php',

    /*
    |--------------------------------------------------------------------------
    | 模型文件名
    |--------------------------------------------------------------------------
    |
    | 模型辅助文件的默认文件名。
    |
    */

    'models_filename' => '_ide_helper_models.php',

    /*
    |--------------------------------------------------------------------------
    | PhpStorm 元数据文件名
    |--------------------------------------------------------------------------
    |
    | PhpStorm 也支持包含任意文件的 `.phpstorm.meta.php/` 目录，
    | 如果你的项目需要额外的文件，例如：
    | `.phpstorm.meta.php/laravel_ide_Helper.php'。
    |
    */
    'meta_filename' => '.phpstorm.meta.php',

    /*
    |--------------------------------------------------------------------------
    | Fluent 辅助方法
    |--------------------------------------------------------------------------
    |
    | 设置为 true 以生成常用的 Fluent 方法。
    |
    */

    'include_fluent' => false,

    /*
    |--------------------------------------------------------------------------
    | Factory 构建器
    |--------------------------------------------------------------------------
    |
    | 设置为 true 以生成 factory 生成器，用于更好的 factory()
    | 方法自动完成。
    |
    | 在 Laravel 8 或更高版本中已弃用。
    |
    */

    'include_factory_builders' => false,

    /*
    |--------------------------------------------------------------------------
    | 编写模型魔术方法
    |--------------------------------------------------------------------------
    |
    | 设置为 false 以禁用编写模型的魔术方法。
    |
    */

    'write_model_magic_where' => true,

    /*
    |--------------------------------------------------------------------------
    | 编写模型外部 Eloquent 构建器方法
    |--------------------------------------------------------------------------
    |
    | 设置为 false 以禁用编写外部 Eloquent 构建器方法。
    |
    */

    'write_model_external_builder_methods' => true,

    /*
    |--------------------------------------------------------------------------
    | 编写模型关联计数属性
    |--------------------------------------------------------------------------
    |
    | 设置为 false 以禁用在模型 DocBlocks 中写入关联计数属性。
    |
    */

    'write_model_relation_count_properties' => true,

    /*
    |--------------------------------------------------------------------------
    | 编写 Eloquent 模型混入
    |--------------------------------------------------------------------------
    |
    | 这将为 Laravel 框架中包含的模型类添加必要的 DocBlock 混入。
    | 这有助于 IDE 的自动完成功能。
    |
    | 请注意，此设置会更改 /vendor 目录中的文件。
    |
    */

    'write_eloquent_model_mixins' => false,

    /*
    |--------------------------------------------------------------------------
    | 要包含的辅助文件
    |--------------------------------------------------------------------------
    |
    | 包含辅助文件。默认不包含，但可以通过 --helpers (-H) 选项启用。
    | 可以包含额外的辅助文件。
    |
    */

    'include_helpers' => false,

    'helper_files' => [
        base_path().'/vendor/laravel/framework/src/Illuminate/Support/helpers.php',
    ],

    /*
    |--------------------------------------------------------------------------
    | 要包含的模型位置
    |--------------------------------------------------------------------------
    |
    | 定义 ide-helper:models 命令应该在哪些目录中查找模型。
    |
    | 支持 glob 模式以便更容易访问子目录中的模型，
    | 例如 `app/Services/* /Models`（不含空格）。
    |
    */

    'model_locations' => [
        'app',
    ],

    /*
    |--------------------------------------------------------------------------
    | 要忽略的模型
    |--------------------------------------------------------------------------
    |
    | 定义应该被忽略的模型。
    |
    */

    'ignored_models' => [
        // App\MyModel::class,
    ],

    /*
    |--------------------------------------------------------------------------
    | 模型钩子
    |--------------------------------------------------------------------------
    |
    | 定义要为模型运行哪些钩子类以添加自定义信息。
    |
    | 钩子应实现 Barryvdh\LaravelIdeHelper\Contracts\ModelHookInterface。
    |
    */

    'model_hooks' => [
        // App\Support\IdeHelper\MyModelHook::class
    ],

    /*
    |--------------------------------------------------------------------------
    | 额外的类
    |--------------------------------------------------------------------------
    |
    | 这些实现实际上并没有被扩展，而是通过魔术函数调用。
    |
    */

    'extra' => [
        'Eloquent' => ['Illuminate\Database\Eloquent\Builder', 'Illuminate\Database\Query\Builder'],
        // 'Session' => ['Illuminate\Session\Store'],
    ],

    'magic' => [],

    /*
    |--------------------------------------------------------------------------
    | 接口实现
    |--------------------------------------------------------------------------
    |
    | 这些接口将被实现类替换。一些接口可以被辅助工具检测到，
    | 其他的可以在下面列出。
    |
    */

    'interfaces' => [
        // App\MyInterface::class => App\MyImplementation::class,
    ],

    /*
    |--------------------------------------------------------------------------
    | 支持驼峰命名的模型
    |--------------------------------------------------------------------------
    |
    | 有一些 Laravel 包（如 Eloquence）允许通过驼峰命名而不是蛇形命名
    | 来访问 Eloquent 模型属性。
    |
    | 启用此选项将支持这些包，所有模型属性将保存为驼峰命名
    | 而不是蛇形命名。
    |
    | 例如，通常你会看到这样：
    |
    |  * @property \Illuminate\Support\Carbon $created_at
    |  * @property \Illuminate\Support\Carbon $updated_at
    |
    | 启用此选项后，属性将变成这样：
    |
    |  * @property \Illuminate\Support\Carbon $createdAt
    |  * @property \Illuminate\Support\Carbon $updatedAt
    |
    | 注意，目前这是一个全有或全无的选项。
    |
    */
    'model_camel_case_properties' => false,

    /*
    |--------------------------------------------------------------------------
    | 属性类型转换
    |--------------------------------------------------------------------------
    |
    | 将给定的"实际类型"转换为给定的"类型"。
    |
    */
    'type_overrides' => [
        'integer' => 'int',
        'boolean' => 'bool',
    ],

    /*
    |--------------------------------------------------------------------------
    | 包含类的 DocBlocks
    |--------------------------------------------------------------------------
    |
    | 包含类的 DocBlocks 以允许对魔术方法和属性进行额外的代码检查。
    |
    */
    'include_class_docblocks' => false,

    /*
    |--------------------------------------------------------------------------
    | 强制使用 FQN
    |--------------------------------------------------------------------------
    |
    | 在 DocBlocks 中使用完全限定（类）名称，
    | 即使该类存在于同一命名空间中
    | 或存在该类的导入语句（use className）。
    |
    */
    'force_fqn' => false,

    /*
    |--------------------------------------------------------------------------
    | 使用泛型语法
    |--------------------------------------------------------------------------
    |
    | 在 DocBlocks 中使用泛型语法，
    | 例如使用 `Collection<User>` 而不是 `Collection|User[]`。
    |
    */
    'use_generics_annotations' => true,

    /*
    |--------------------------------------------------------------------------
    | 额外的关联类型
    |--------------------------------------------------------------------------
    |
    | 有时需要创建自定义关联类型。数组的键是关联方法名称。
    | 数组的值是关联的完全限定类名，
    | 例如 `'relationName' => RelationShipClass::class`。
    |
    */
    'additional_relation_types' => [],

    /*
    |--------------------------------------------------------------------------
    | 额外的关联返回类型
    |--------------------------------------------------------------------------
    |
    | 使用自定义关联类型时，类名可能不包含关联的正确返回类型。
    | 数组的键是关联方法名称。数组的值是关联的返回类型
    | （'many' 或 'morphTo'）。
    | 例如 `'relationName' => 'many'`。
    |
    */
    'additional_relation_return_types' => [],

    /*
    |--------------------------------------------------------------------------
    | 在迁移后运行 artisan 命令以生成模型辅助工具
    |--------------------------------------------------------------------------
    |
    | 指定的命令应在迁移完成后运行。
    |
    */
    'post_migrate' => [
        'ide-helper:models --nowrite',
    ],

];
